using System;

namespace PrintSqlite
{
    /// <summary>
    /// 设备的可用性和状态。
    /// </summary>
    public enum Availability
    {
        其他 = 1,
        未知 = 2,
        全功率运行 = 3,
        警告 = 4,
        在试验中 = 5,
        不适用 = 6,
        功率关闭 = 7,
        脱机 = 8,
        离线 = 9,
        退化 = 10,
        不安装 = 11,
        安装误差 = 12,
        功率未知 = 13,
        低功耗模式 = 14,
        电源待机 = 15,
        功率循环 = 16,
        功率预警 = 17,
        暂停 = 18,
        没有准备好 = 19,
        未配置 = 20,
    }
    /// <summary>
    /// 打印机错误信息。
    /// </summary>
    public enum DetectedErrorState
    {
        未知 = 0,
        其他 = 1,
        无误差 = 2,
        低纸 = 3,
        无纸 = 4,
        低墨粉 = 5,
        无墨粉 = 6,
        门开 = 7,
        卡住 = 8,
        离线 = 9,
        服务要求 = 10,
        输出纸盒已满 = 11,
    }

    /// <summary>
    /// 报告标准错误信息。其他信息应在DetectedErrorState中记录。
    /// </summary>
    public enum ExtendedDetectedErrorState
    {
        未知 = 0,
        其它 = 1,
        无误差 = 2,
        低纸 = 3,
        无纸 = 4,
        低墨粉 = 5,
        无墨粉 = 6,
        门开 = 7,
        卡住了 = 8,
        服务请求 = 9,
        输出bin全 = 10,
        纸问题 = 11,
        不能打印页 = 12,
        需要用户干预 = 13,
        内存不足 = 14,
        未知服务 = 15,
    }

    /// <summary>
    /// 打印机的只读状态信息，该信息不同于可用性属性中指定的信息。
    /// </summary>
    public enum ExtendedPrinterStatus
    {
        其他 = 1,
        未知 = 2,
        空闲 = 3,
        打印 = 4,
        预热 = 5,
        停止打印 = 6,
        脱机 = 7,
        暂停 = 8,
        错误 = 9,
        繁忙 = 10,
        不可用 = 11,
        等待 = 12,
        处理 = 13,
        初始化 = 14,
        电源保护 = 15,
        等待删除 = 16,
        激活输入输出 = 17,
        手动送纸 = 18,
    }

    /// <summary>
    /// 不推荐使用与此打印机相关的可能状态之一。此属性已过时。为了代替这个属性，请使用PrinterStatus。
    /// </summary>
    [Flags]
    public enum PrinterState
    {
        空闲,
        已暂停,
        错误,
        等待删除,
        卡纸,
        出纸,
        手动送纸,
        纸张问题,
        离线,
        输入输出激活,
        忙,
        打印,
        输出箱满,
        无法使用,
        等候,
        处理,
        初始化,
        预热,
        碳粉不足,
        没有碳粉,
        纸张有问题,
        需要用户干预,
        内存不足,
        门打开了,
        未知服务,
        节能
    }

    /// <summary>
    /// 打印机的状态信息，该打印机与逻辑设备可用性属性中指定的信息不同。
    /// </summary>
    public enum PrinterStatus
    {
        其他 = 1,
        未知 = 2,
        空闲 = 3,
        打印 = 4,
        预热 = 5,
        停止打印 = 6,
        离线 = 7,
    }
}
